---
kind: method
id: M:Autodesk.Revit.Creation.Application.NewBoundingBoxXYZ
source: html/d3361779-4465-212a-52b4-4445dc5a6314.htm
---
# Autodesk.Revit.Creation.Application.NewBoundingBoxXYZ Method

Creates a three-dimensional rectangular box.

## Syntax (C#)
```csharp
public BoundingBoxXYZ NewBoundingBoxXYZ()
```